/*************************************************************************
* 
*   Copyright (C), 2017-2027, BPG. Co., Ltd.
* 
*   文件名称: objectdetect.h
*   软件模块: 应用模块
*   版 本 号: 1.0
*   生成日期: 2025-04-23
*   作    者: lium
*   功    能: 目标检测
* 
*************************************************************************/

#ifndef OBJECTDETECT_H
#define OBJECTDETECT_H

class CObjectDetect{

public:
    explicit CObjectDetect(void);
    ~CObjectDetect();

private:

};

#endif /**OBJECTDETECT_H */

/*************************************************************************
* 改动历史纪录：
* Revision 1.0, 2025-04-23, lium
* describe: 初始创建.
*************************************************************************/
