/*************************************************************************
 *
 *   Copyright (C), 2017-2027, BPG. Co., Ltd.
 *
 *   文件名称: main.cpp
 *   软件模块: 目标检测
 *   版 本 号: 1.0
 *   生成日期: 2025-07-23
 *   作    者: lium
 *   功    能: 关键点检测测试
 *
 ************************************************************************/

#include "yolov8pose.h"

/**17个关键点的颜色 */
static const std::vector<std::vector<unsigned int>> KPS_COLORS =
    {{0, 255, 0}, /**1号点的颜色 */
     {0, 255, 0}, /**2号点的颜色 */
     {0, 255, 0}, /**3号点的颜色 */
     {0, 255, 0},
     {0, 255, 0},
     {255, 128, 0},
     {255, 128, 0},
     {255, 128, 0},
     {255, 128, 0},
     {255, 128, 0},
     {255, 128, 0},
     {51, 153, 255},
     {51, 153, 255},
     {51, 153, 255},
     {51, 153, 255},
     {51, 153, 255},
     {51, 153, 255}};

/**
 * 17个关键点的之间的连接规则
 * 小序号的点连接到大序号的点
 * 下面的连接规则是特殊的项目需求。
 * 参考链接：https://blog.csdn.net/FL1623863129/article/details/149387052
 */
static const std::vector<std::vector<unsigned int>> SKELETON = {{16, 14}, /**16号点连接到14号点 */
                                                                {14, 12}, /**14号点连接到12号点 */
                                                                {17, 15}, /**17号点连接到15号点 */
                                                                {15, 13},
                                                                {12, 13},
                                                                {6, 12},
                                                                {7, 13},
                                                                {6, 7},
                                                                {6, 8},
                                                                {7, 9},
                                                                {8, 10},
                                                                {9, 11},
                                                                {2, 3},
                                                                {1, 2},
                                                                {1, 3},
                                                                {2, 4},
                                                                {3, 5},
                                                                {4, 6},
                                                                {5, 7}};

/**连接线段的颜色(对应连接规则) */
static const std::vector<std::vector<unsigned int>> LIMB_COLORS = {{51, 153, 255},
                                                                   {51, 153, 255},
                                                                   {51, 153, 255},
                                                                   {51, 153, 255},
                                                                   {255, 51, 255},
                                                                   {255, 51, 255},
                                                                   {255, 51, 255},
                                                                   {255, 128, 0},
                                                                   {255, 128, 0},
                                                                   {255, 128, 0},
                                                                   {255, 128, 0},
                                                                   {255, 128, 0},
                                                                   {0, 255, 0},
                                                                   {0, 255, 0},
                                                                   {0, 255, 0},
                                                                   {0, 255, 0},
                                                                   {0, 255, 0},
                                                                   {0, 255, 0},
                                                                   {0, 255, 0}};

int main(int argc, char **argv)
{
    std::string modelPath = "weigths/yolov8l-pose.onnx";
    std::string classNamePath = "weigths/yolov8l-pose.txt";
    std::string srcImgPath = "data/test3.jpg";

    std::shared_ptr<CYoloV8Pose> obj = std::make_shared<CYoloV8Pose>(modelPath, classNamePath);
    obj->modelDetect(srcImgPath, SKELETON, KPS_COLORS, LIMB_COLORS);

    cv::waitKey(0);
    cv::destroyAllWindows();
}

/*************************************************************************
 * 改动历史纪录：
 * Revision 1.0, 2025-07-23, lium
 * describe: 初始创建.
 *************************************************************************/